## Terraform Summary

| Step                         | Result  |
|:-----------------------------|:-------:|
| 🖌  Terraform Format & Style | ✅ |
| ⚙️  Terraform Initialization  | ✅ |
| 🤖  Terraform Validation     | ✅ |
| 📖  Terraform Plan           | ✅ |

_**Hint:** If "Terraform Format & Style" failed, run `terraform fmt -recursive` from the `terraform/` directory and commit the results._

### Output

<details>
<summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

<details>
<summary>Plan Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place
-   destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_ecs_service.console will be updated in-place
  ~ resource "aws_ecs_service" "console" {
        id                                 = "arn:aws:ecs:us-west-2:357150818708:service/cpfreporter/cpfreporter-console"
        name                               = "cpfreporter-console"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:73" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.console must be replaced
+/- resource "aws_ecs_task_definition" "console" {
      ~ arn                      = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:73" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ image                  = "ghcr.io/usdigitalresponse/cpf-reporter-console@sha256:c952ce7fc6e6d41622c452036aff2cdb0449eb02ea5c73d673e0ae0bd965227a" -> "ghcr.io/usdigitalresponse/cpf-reporter-console@sha256:a511a13b81d7e6c6eb39994004b92bc2da864fc49631be1645ede9a7b77d06af"
-                   mountPoints            = []
                    name                   = "console"
-                   portMappings           = []
-                   systemControls         = []
-                   volumesFrom            = []
                    # (7 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "cpfreporter-console" -> (known after apply)
      ~ revision                 = 73 -> (known after apply)
-       tags                     = {} -> null
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_s3_bucket_notification.reporting_data will be updated in-place
  ~ resource "aws_s3_bucket_notification" "reporting_data" {
        id          = "cpfreporter-reportingdata-357150818708-us-west-2"
        # (2 unchanged attributes hidden)

      ~ lambda_function {
          ~ filter_suffix       = ".xlsm" -> ".json"
            id                  = "tf-s3-lambda-20240110143800686200000007"
            # (3 unchanged attributes hidden)
        }
      ~ lambda_function {
          ~ filter_suffix       = ".xlsm.json" -> ".xlsm"
            id                  = "tf-s3-lambda-20240110143800686200000008"
            # (3 unchanged attributes hidden)
        }
    }

  # aws_s3_object.lambda_artifact-cpfValidation will be updated in-place
  ~ resource "aws_s3_object" "lambda_artifact-cpfValidation" {
      ~ etag                   = "82c0c0266dddcb2a9e094551bc4cad32-5" -> "07bca370db6319ce03a40b0b1c0599bc"
        id                     = "cpfValidation.07bca370db6319ce03a40b0b1c0599bc.zip"
        tags                   = {}
      ~ version_id             = "k.DraEF_t34O1hBHwcnfRHAaqFBJDCz6" -> (known after apply)
        # (12 unchanged attributes hidden)
    }

  # aws_s3_object.lambda_artifact-excelToJson will be updated in-place
  ~ resource "aws_s3_object" "lambda_artifact-excelToJson" {
      ~ etag                   = "9cbecef1161ca87d2d79f4e8ccfb1ac3-6" -> "7b4544585eee7c04a389cb50376759fb"
        id                     = "excelToJson.7b4544585eee7c04a389cb50376759fb.zip"
        tags                   = {}
      ~ version_id             = "OPtPZdZQtFO82be7Je0XtWhsaa59IIAG" -> (known after apply)
        # (12 unchanged attributes hidden)
    }

  # aws_s3_object.lambda_artifact-graphql will be updated in-place
  ~ resource "aws_s3_object" "lambda_artifact-graphql" {
      ~ etag                   = "6504ec6433ddb45673063fe465c6dc4d-6" -> "1d3fd0f3db4f66fe2ce5bc04f4f8d75c"
        id                     = "graphql.1d3fd0f3db4f66fe2ce5bc04f4f8d75c.zip"
        tags                   = {}
      ~ version_id             = "RRll5deCSTI8hyK57OcdVpq4JoPjeEU0" -> (known after apply)
        # (12 unchanged attributes hidden)
    }

  # aws_s3_object.lambda_artifact-python will be created
+   resource "aws_s3_object" "lambda_artifact-python" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "cpfreporter-lambdaartifacts-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = (known after apply)
+       etag                   = (known after apply)
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "python.fd2f1653029737d0635ebc608b3d4700.zip"
+       kms_key_id             = (known after apply)
+       server_side_encryption = (known after apply)
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/python/dist/zipballs/lambda.zip"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["200.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "cdea6b71a3057ef2f17e257c3ab12eaf" -> "247026c19fa45e569bb67da363395728"
        id                     = "dist/200.html"
      ~ source_hash            = "cdea6b71a3057ef2f17e257c3ab12eaf" -> "247026c19fa45e569bb67da363395728"
        tags                   = {}
      ~ version_id             = "bfVAfGnS7VvZocQRqY5.N0xD9T9br__4" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["build-manifest.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "98fc56faeef9270b9b6e60375512aec1" -> "78396326e6811e5f3eb72959cead2172"
        id                     = "dist/build-manifest.json"
      ~ source_hash            = "98fc56faeef9270b9b6e60375512aec1" -> "78396326e6811e5f3eb72959cead2172"
        tags                   = {}
      ~ version_id             = "WodsIcNTwkEUSNZLZuTxc_dYCWW7bjQQ" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["chunk-references.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "3c0c0a99ce1c90d7eefb7dbe1b545e15" -> "f6206cd5324cf9c6ec45efafeda77ca0"
        id                     = "dist/chunk-references.json"
      ~ source_hash            = "3c0c0a99ce1c90d7eefb7dbe1b545e15" -> "f6206cd5324cf9c6ec45efafeda77ca0"
        tags                   = {}
      ~ version_id             = "O8wpaqJguueOcFxFCdwpBXuQL1ZdrAsW" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["index.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "cdea6b71a3057ef2f17e257c3ab12eaf" -> "247026c19fa45e569bb67da363395728"
        id                     = "dist/index.html"
      ~ source_hash            = "cdea6b71a3057ef2f17e257c3ab12eaf" -> "247026c19fa45e569bb67da363395728"
        tags                   = {}
      ~ version_id             = "8O8lyfUzC7CJSefeVmrRB_XtghsTAVTO" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.4ee77ff4.js"] will be destroyed
  # (because key ["static/js/app.4ee77ff4.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       arn                    = "arn:aws:s3:::cpfreporter-origin-357150818708-us-west-2/dist/static/js/app.4ee77ff4.js" -> null
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "16d155dab8471f730ccf7ffdae3ecc17" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/app.4ee77ff4.js" -> null
-       key                    = "dist/static/js/app.4ee77ff4.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.4ee77ff4.js" -> null
-       source_hash            = "16d155dab8471f730ccf7ffdae3ecc17" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "fEcSlWacwkiEJa7lFUqzRKTBepVDRCAd" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.4ee77ff4.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/app.4ee77ff4.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       arn                    = "arn:aws:s3:::cpfreporter-origin-357150818708-us-west-2/dist/static/js/app.4ee77ff4.js.LICENSE.txt" -> null
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "b703266ba347d460c07ac79899e011fa" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/app.4ee77ff4.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/app.4ee77ff4.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.4ee77ff4.js.LICENSE.txt" -> null
-       source_hash            = "b703266ba347d460c07ac79899e011fa" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "OKDFRyav0XtnansR5HEnMOHqtov_Y.vn" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.b0f1595e.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "40d7f5b8f234664c773ffa3349840612"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/app.b0f1595e.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.b0f1595e.js"
+       source_hash            = "40d7f5b8f234664c773ffa3349840612"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.b0f1595e.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "b703266ba347d460c07ac79899e011fa"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/app.b0f1595e.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.b0f1595e.js.LICENSE.txt"
+       source_hash            = "b703266ba347d460c07ac79899e011fa"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # module.lambda_function-cpfValidation.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-cpfValidation"
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-cpfValidation:41" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-cpfValidation:41/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "41" -> (known after apply)
        # (21 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                = "3ffcb061ea17b064d813a61e81a54dffe4ddd1d1" -> "34bb551a5c68e917c009b0b50608cd4bdd3f8ca4"
              ~ "DD_TAGS"                      = "git.commit.sha:3ffcb061ea17b064d813a61e81a54dffe4ddd1d1,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:34bb551a5c68e917c009b0b50608cd4bdd3f8ca4,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                   = "3ffcb061ea17b064d813a61e81a54dffe4ddd1d1" -> "34bb551a5c68e917c009b0b50608cd4bdd3f8ca4"
                # (14 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # module.lambda_function-cpfValidation.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "41" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function-excelToJson.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-excelToJson"
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-excelToJson:42" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-excelToJson:42/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "42" -> (known after apply)
        # (21 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                = "3ffcb061ea17b064d813a61e81a54dffe4ddd1d1" -> "34bb551a5c68e917c009b0b50608cd4bdd3f8ca4"
              ~ "DD_TAGS"                      = "git.commit.sha:3ffcb061ea17b064d813a61e81a54dffe4ddd1d1,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:34bb551a5c68e917c009b0b50608cd4bdd3f8ca4,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                   = "3ffcb061ea17b064d813a61e81a54dffe4ddd1d1" -> "34bb551a5c68e917c009b0b50608cd4bdd3f8ca4"
                # (13 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # module.lambda_function-excelToJson.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "42" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function-graphql.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-graphql"
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-graphql:89" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-graphql:89/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "89" -> (known after apply)
        # (21 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                      = "3ffcb061ea17b064d813a61e81a54dffe4ddd1d1" -> "34bb551a5c68e917c009b0b50608cd4bdd3f8ca4"
              ~ "DD_TAGS"                            = "git.commit.sha:3ffcb061ea17b064d813a61e81a54dffe4ddd1d1,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:34bb551a5c68e917c009b0b50608cd4bdd3f8ca4,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                         = "3ffcb061ea17b064d813a61e81a54dffe4ddd1d1" -> "34bb551a5c68e917c009b0b50608cd4bdd3f8ca4"
                # (17 unchanged elements hidden)
            }
        }

        # (5 unchanged blocks hidden)
    }

  # module.lambda_function-graphql.aws_lambda_permission.current_version_triggers["APIGateway"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "APIGateway" -> (known after apply)
      ~ qualifier           = "89" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 7 to add, 12 to change, 6 to destroy.
```

</details>

*Pusher: @as1729, Action: `pull_request_target`, Workflow: [`Continuous Integration`](https://github.com/usdigitalresponse/cpf-reporter/actions/runs/8603803808)*